In [4]:
import pandas as pd
import numpy as np

## Part 1

In [5]:
data = pd.read_csv('day_01_input.csv', header = None)
data

         0
0      199
1      227
2      229
3      230
4      233
...    ...
1995  6110
1996  6109
1997  6120
1998  6117
1999  6110

[2000 rows x 1 columns]

In [6]:
shifted = data.shift(periods=1, fill_value= 199)
shifted

         0
0      199
1      199
2      227
3      229
4      230
...    ...
1995  6107
1996  6110
1997  6109
1998  6120
1999  6117

[2000 rows x 1 columns]

In [7]:
difference = data.sub(shifted)
difference

       0
0      0
1     28
2      2
3      1
4      3
...   ..
1995   3
1996  -1
1997  11
1998  -3
1999  -7

[2000 rows x 1 columns]

In [8]:
is_larger = difference.where(difference > 0)
is_larger

         0
0      NaN
1     28.0
2      2.0
3      1.0
4      3.0
...    ...
1995   3.0
1996   NaN
1997  11.0
1998   NaN
1999   NaN

[2000 rows x 1 columns]

In [9]:
is_larger = is_larger.value_counts()
is_larger

1.0     346
2.0     177
3.0     155
4.0     105
5.0      80
6.0      75
7.0      63
8.0      58
10.0     47
9.0      45
11.0     34
16.0     26
18.0     26
12.0     23
13.0     23
14.0     22
15.0     21
17.0     18
21.0     12
24.0     10
19.0      9
20.0      9
28.0      8
22.0      7
23.0      6
25.0      6
27.0      6
30.0      5
31.0      4
32.0      4
26.0      3
33.0      3
34.0      3
40.0      3
35.0      2
36.0      2
Name: count, dtype: int64

In [10]:
is_larger.sum()

1446

## Part 2

In [11]:
shifted1 = data.shift(periods=1, fill_value= 0)
shifted2 = data.shift(periods=2, fill_value= 0)
#shifted2

In [12]:
sliding_window = data + shifted1 + shifted2
#sliding_window

In [13]:
sliding_window0 = sliding_window.shift(periods=-2, fill_value= None)
sliding_window1 = sliding_window.shift(periods=-3, fill_value= None)
#sliding_window1

In [14]:
difference = (sliding_window1 - sliding_window0)
#difference

In [15]:
difference.where(difference > 0).value_counts().sum()

1486

//////////////////////////